#include <stdio.h>
//int main()
//{
//	int a[3][2] = { (0, 1), (2, 3), (4, 5) };
//	//逗号表达式只计算最后面那个
//	//相当于int a[3][2]={1,3,5};
//	//第一行：1 3
//	//第二行：5 0
//	//第三行：0 0
//	//p[0]相当于*(p+0)，所以打印的结果为1
//	int *p;
//	p = a[0];
//	printf("%d", p[0]);
//	return 0;
//}

//int main()
//{
//	int aa[2][5] = { 10, 9, 8, 7, 6, 5, 4, 3, 2, 1 };
//	int *ptr1 = (int *)(&aa + 1);
//	int *ptr2 = (int *)(*(aa + 1));
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));
//	return 0;
//}
////输出的结果是1和6

int main()
{
	int a[5] = { 5, 4, 3, 2, 1 };
	int *ptr = (int *)(&a + 1);
	printf("%d,%d", *(a + 1), *(ptr - 1));
	return 0;
}
//输出的结果为4和1