#include<stdio.h>
//int main()
//{
//	int arr[5] = { 1,3,5,1,3};
//	int i = 0;
//	int num = 0;
//	for (i = 0; i <5; i++)
//	{
//			num ^= arr[i];
//		printf("%d\n", num);
//	}
//	return 0;
//}
//此代码最终的num结果为只出现一次的5，可以这么理解，1与1异或为0,3与3异或为0,5与0异或的结果为自身
//  0^1^3^5^1^3
#define SWAP(X)  X=(((X&0x55555555)<<1) | ( (X&0xaaaaaaaa)>>1))
//#define SWAP(X)  (((X&0x55555555)<<1) | ( (X&0xaaaaaaaa)>>1))
int main()
{
	int a = 10;
	//1. 把这个数所有的偶数位保留，奇数为0
	//   把得到的数字，向左移动一位
	//2. 把这个数所有的奇数位保留，偶数为0
	//   把得到的数字，向右移动一位
	//3. 把前面得到的2个数字按位或

	//00000000000000000000000001011010
	//10101010101010101010101010101010
	//
	//01010101010101010101010101010101
	//0x55555555
	
	printf("%d\n", SWAP(a));
	//00000000000000000000000000000101 - 5
	//
	return 0;
}